[
  {
    "id": "7335311327885701120",
    "chunk_text": "Title: See***ney***ice*********s a********************* | Post: https://lnkd.in/gzMAVvj3 | User: Mon***hoi***Cap*********st | Link Title: Mon***hoi***- B*********mon************",
    "metadata": {
      "url": "https://www.linkedin.com/posts/moneychoicecapital_activity-7335311327885701120-Ii50",
      "user_id": "Mon***hoi***Cap******",
      "user_url": "https://www.linkedin.com/company/moneychoicecapital?trk=public_post_feed-actor-image",
      "post_type": "repost",
      "date_posted": "2025-06-07T06:22:04.869Z",
      "year": 2025,
      "month": 6,
      "day_of_week": "Saturday",
      "num_likes": 3,
      "num_comments": 0,
      "user_followers": 2356,
      "user_posts": 0,
      "user_articles": 0,
      "has_images": false,
      "has_videos": false,
      "has_documents": false,
      "num_embedded_links": 1,
      "has_external_links": true,
      "num_tagged_companies": 0,
      "num_tagged_people": 0,
      "is_repost": false,
      "post_length": 24,
      "post_word_count": 1
    }
  },
  {
    "id": "7292588103670673408",
    "chunk_text": "Title: I l*** my***mil*********ses********************* mu********************* | Post: I love my family businesses—they’ve taught me so much. They’re dynamic, fun, and wildly unpredictable at times. They keep me on my toes, and sometimes, it feels like I need to wear a helmet. But here’s the thing: over time, I’ve learned that a family business is really just like any other business—as long as you can coach the team to make decisions through three lenses: family, owner, and business. One of the best things I’ve learned comes from Sara B. Stern —a family business mastermind—who introduced me to the Harvard University concept of the three circles of a family business—owners, family, and business. It’s one of my favorite tools, and it’s a game-changer. Why? Because it creates clarity on where issues belong, which helps the business keep moving forward, without dragging family drama into the mix. Here’s my role: I work for the business and its leadership team, supporting the company’s success. I do not work as a family therapist or mediator. I’m not here to resolve family drama or facilitate fights over the dinner table. If the family members in the business want to hash out personal issues, that’s a private family matter—not a business matter. And let me be clear: Family members working in the business? I hold them accountable, just like anyone else. If they’re not pulling their weight, they can be fired, too. We’re not here to solve family squabbles that should be dealt with at home. The leadership team needs to stay focused on the business. They don’t need a front-row seat to your drama. (Trust me, they really don’t.) As for owner’s issues? Those need to happen at owner meetings. Every owner gets a say and access to information—but unless they’re actively accountable in the business, their issues belong outside the business, at the owners' table. Why talk about all of this? Because I know first hand that many family businesses struggle with extra layers of dynamics in business which can create confusion and frustration. I am here to tell you that it is absolutely possible to run a family business that’s functional, drama-free, and results-driven. It just takes some discipline and a little tough love on where to place issues. Simple. Not easy! EOS Worldwide Melanie.Towey@eosworldwide.com | User: Mel***e T***y’s****** | Position: Cer***ied***S I*********r® *********************eak****************************************************************** | Comments: Amazing!!! | This has been incredibly helpful also as I've brought it into family businesses over the last year! The biggest impact I've seen so far is to that it begins establishing appropriate meeting pulses with the right attendees and agendas. | I love small family-owned businesses as well! Thanks for sharing!",
    "metadata": {
      "url": "https://www.linkedin.com/posts/melanie-towey_i-love-my-family-businessestheyve-taught-activity-7292588103670673408-xRTt",
      "user_id": "mel***e-t***y",
      "user_url": "https://www.linkedin.com/in/melanie-towey",
      "post_type": "post",
      "account_type": "Person",
      "date_posted": "2025-02-04T17:01:33.618Z",
      "year": 2025,
      "month": 2,
      "day_of_week": "Tuesday",
      "num_likes": 46,
      "num_comments": 4,
      "user_followers": 5411,
      "user_posts": 807,
      "user_articles": 0,
      "has_images": true,
      "has_videos": false,
      "has_documents": false,
      "num_embedded_links": 3,
      "has_external_links": false,
      "num_tagged_companies": 1,
      "num_tagged_people": 1,
      "tagged_company_names": "EOS Worldwide",
      "tagged_people_names": "Sara ** S***n",
      "is_repost": false,
      "top_comments_count": 3,
      "total_comment_reactions": 4,
      "unique_commenters": "Sarah Ellis, Sara B. Stern, Patrick Metzger",
      "post_length": 2239,
      "post_word_count": 374
    }
  },
  {
    "id": "7354899432573710336",
    "chunk_text": "Title: Sta***ign***ng *********nts********************* | *************** | Post: Start ignoring your clients until you lose them. Seriously. Try it. When you first meet a client, diagnose his problems very well. Act like an expert. Bombard him with everything you know. Pretend as if you share the throne with Elon Musk. Promise him deadly change in his life. Let him assume that you brain is not a brain. It's a supercomputer. The alknower. THE MASTER OF THE CRAFT. Tell him, \"Your copy lacks emotion\" \"You need a strategy\" \"You need to position yourself\" \"You need to roast your competitors\" \"I'll make you go viral.\" Promise him a seat in heaven. And after the clients gets on his knees with a bouquet and dumps all his life's savings in your pocket, Boom! Disappear. Go underground. Don't check his texts. Don't pick his calls. And better yet, turn your phone off. Let him keep ringing you up. Let the client cry under the blanket. Let him think that he was dumb to trust you. Let him see for himself how shitty of a place this world can often be. Let him go out and tell every other person he meets, that your service is shitty. that he feels betrayed. And how he would prefer jumping off a cliff but never come back to you. Try it. Trust me. Your life will change. How? You'll start getting fewer and fewer clients so that you finally, start having more free time. start going home early start eating more healthy Dal and Rice (because apparently restaurant food is expensive) And you finally, start having a life away from work. Often, with no work and all rest. So do it. And after you finally reach the stage when your mental health is about to crash, when bankruptcy is knocking at the door, and when you're about to get a divorce, Come to us. And tell us how marketing must make you go viral in a day and how your business MUST make 10 crores every week from next Monday. Then also, Be ready to hear us respond with the the century old marketing wisdom yet again: \"Reply to clients on time.\" \"Pick calls and call back on time\" \"Keep your reputation first, money second.\" \"Give value first.\" And for God's sake! this time, do it. And for God's sake, understand, \"marketing can only GET you customers. Your product and services KEEP them.\" And if you're losing your current customers, It's probably not the marketing. It's you. Your product. Your service. And after you finally fix the fundamentals. let's then talk about better stuff. Marketing. You're welcome. | User: Sim*** Ka***🔮’********* | Position: Bra***amb***ado*********' m*********************| C*************************************************************************************************************************************** | Comments: Guys😂 This post isn't about taking breaks!! So read before you comment or react☠️ | You don't rise to the level of your marketing. You fall to the level of your services. (I taught James Clear how to write quotes 🤫) | I regret posting this on a Saturday evening 🥲",
    "metadata": {
      "url": "https://www.linkedin.com/posts/simrankaur0507_start-ignoring-your-clients-until-you-lose-activity-7354899432573710336-uU2B",
      "user_id": "sim***kau***07",
      "user_url": "https://in.linkedin.com/in/simrankaur0507?trk=public_post_feed-actor-image",
      "post_type": "post",
      "account_type": "Person",
      "date_posted": "2025-07-26T15:44:32.104Z",
      "year": 2025,
      "month": 7,
      "day_of_week": "Saturday",
      "num_likes": 32,
      "num_comments": 22,
      "user_followers": 3133,
      "user_posts": 78,
      "user_articles": 0,
      "has_images": false,
      "has_videos": false,
      "has_documents": false,
      "num_embedded_links": 0,
      "has_external_links": false,
      "num_tagged_companies": 0,
      "num_tagged_people": 0,
      "is_repost": false,
      "top_comments_count": 10,
      "total_comment_reactions": 8,
      "unique_commenters": "Kapirath Raina, Simran Kaur 🔮, Shreya T., Mahalakshmi Raja, Aditi Sood, Vishnu Prasath, Bhavya Mehta, Aryan Thakur",
      "post_length": 2390,
      "post_word_count": 431
    }
  }
]